saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.SAML11_DFP.1.0.82.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
         xmlns:saxon="http://saxon.sf.net//"
         schemaVersion="1.4.0"
         xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Keil</vendor>
   <url>http://www.keil.com/pack/</url>
   <name>SAML11_DFP</name>
   <description>Microchip SAML11 Series Device Support</description>
   <releases>
      <release version="1.0.82" date="2018-07-20">
        Updated Device Startup files for ARM Compiler:
        - system files: added initialization of the VTOR register.
        - startup assembler file: doubled the default stack size to 1KB.
      </release>
      <release version="1.0.81" date="2018-06-27">
        Initial version of device family pack for SAML11.
        !!! REQUIRES MDK 5.26 pre-release or higher because this pack implements flash programming via debug sequences. !!!
      </release>
   </releases>
   <keywords>
      <keyword>Microchip</keyword>
      <keyword>Device Family Package Microchip</keyword>
      <keyword>Device Support</keyword>
      <keyword>SAML11</keyword>
   </keywords>
   <devices>
      <family Dfamily="SAML11" Dvendor="Microchip:3">
        <book name="mdk/apnt_315.pdf" title="Programming Microchip SAML11 in Arm MDK"/>
        <description>The Microchip SAM L11 family of microcontrollers is based on the Arm® Cortex®-M23 core, featuring Arm TrustZone® technology for ARMv8M, a programmable environment that provides hardware isolation between certified libraries, IP and application code.
		
		In addition to TrustZone, the SAML11 security features include an on-board cryptographic module  supporting Advanced Encryption Standard (AES), Galois Counter Mode (GCM) and Secure Hash Algorithm (SHA). The secure boot and secure key storage with tamper detection capabilities establish hardware root of trust. It also offers secure bootloader for secure firmware upgrades.
		
		SAML11 is ultra-low power and offers latest generation Peripheral Touch Controller (PTC) for capacitive touch capabilities. The PTC adds Driven Shield Plus to provide superior water tolerance and excellent noise immunity enabling elegant touch interfaces. The SAML10/L11 family is ideal for a myriad of IoT and security, automotive, appliance, medical and consumer applications whether hardwired or battery powered.
        </description>
        <!-- CMSIS Flash Algorithm - pre-defined variables:
          __FlashAddr: address used for sequence
          __FlashLen:  lenght in bytes used for sequence
          __FlashArg:  set to the value of <flashinfo.block.arg>
          __FlashOp:   1 = Erase 2 = Program, 3 = Verify
    
          __Result:  0 = OK, -1 = Failed
          -->

        <!-- CMSIS Flash Algorithm - Configuration NVM User Row (UROW) -->
        <flashinfo
          name     ="NVM User Row (UROW)"
          start    ="0x00804000"
          blankval ="0xFFFFFFFF"
          pagesize ="0x00000020"
          ptime    ="100000"
          etime    ="1000000">
          <block count="1" size="0x20" arg="0" />
        </flashinfo>

        <!-- CMSIS Flash Algorithm - Configuration Boot Configuration Row (BOCOR) -->
        <flashinfo
          name     ="NVM Boot Configuration Row (BOCOR)"
          start    ="0x0080C000"
          blankval ="0xFFFFFFFF"
          pagesize ="0x00000100"
          ptime    ="100000"
          etime    ="1000000">
          <block count="1" size="0x100" arg="0" />
        </flashinfo>


        <debug defaultResetSequence="ResetSystem"/>
        
        <debugvars configfile="debug/SAML11.dbgconf">
          // Debugger Setup
          __var CE_Select               = 0x00000002;
          __var CE0_Keyword0            = 0xFFFFFFFF;
          __var CE0_Keyword1            = 0xFFFFFFFF;
          __var CE0_Keyword2            = 0xFFFFFFFF;
          __var CE0_Keyword3            = 0xFFFFFFFF;
          __var CE1_Keyword0            = 0xFFFFFFFF;
          __var CE1_Keyword1            = 0xFFFFFFFF;
          __var CE1_Keyword2            = 0xFFFFFFFF;
          __var CE1_Keyword3            = 0xFFFFFFFF;
          __var CE2_Keyword0            = 0xFFFFFFFF;
          __var CE2_Keyword1            = 0xFFFFFFFF;
          __var CE2_Keyword2            = 0xFFFFFFFF;
          __var CE2_Keyword3            = 0xFFFFFFFF;
          // Device Setup
          __var ProgramDebugAccessLevel = 0x00000002;
          __var UROW_Program            = 0x00000000;
          __var BOCOR_Program           = 0x00000000;
          //   UROW Configuration
          __var UROW_Config0            = 0x0000E03F;
          __var UROW_Config1            = 0x00001800;
          __var UROW_Config2            = 0x7F0800FF;
          __var UROW_Config3            = 0x00000001;
          __var UROW_NONSECA            = 0x00000000;
          __var UROW_NONSECB            = 0x00000000;
          __var UROW_NONSECC            = 0x00000000;
          //   BOCOR Configuration
          __var BOCOR_Config0           = 0xA0000000;
          __var BOCOR_Config1           = 0x00030000;
          __var BOCOR_ROMVersion        = 0x0000003A;
          __var BOCOR_CE0_Keyword0      = 0xFFFFFFFF;
          __var BOCOR_CE0_Keyword1      = 0xFFFFFFFF;
          __var BOCOR_CE0_Keyword2      = 0xFFFFFFFF;
          __var BOCOR_CE0_Keyword3      = 0xFFFFFFFF;
          __var BOCOR_CE1_Keyword0      = 0xFFFFFFFF;
          __var BOCOR_CE1_Keyword1      = 0xFFFFFFFF;
          __var BOCOR_CE1_Keyword2      = 0xFFFFFFFF;
          __var BOCOR_CE1_Keyword3      = 0xFFFFFFFF;
          __var BOCOR_CE2_Keyword0      = 0xFFFFFFFF;
          __var BOCOR_CE2_Keyword1      = 0xFFFFFFFF;
          __var BOCOR_CE2_Keyword2      = 0xFFFFFFFF;
          __var BOCOR_CE2_Keyword3      = 0xFFFFFFFF;
          __var BOCOR_CRC_Keyword0      = 0xFFFFFFFF;
          __var BOCOR_CRC_Keyword1      = 0xFFFFFFFF;
          __var BOCOR_CRC_Keyword2      = 0xFFFFFFFF;
          __var BOCOR_CRC_Keyword3      = 0xFFFFFFFF;
          __var BOCOR_BOOT_Keyword0     = 0xFFFFFFFF;
          __var BOCOR_BOOT_Keyword1     = 0xFFFFFFFF;
          __var BOCOR_BOOT_Keyword2     = 0xFFFFFFFF;
          __var BOCOR_BOOT_Keyword3     = 0xFFFFFFFF;
          __var BOCOR_BOOT_Keyword4     = 0xFFFFFFFF;
          __var BOCOR_BOOT_Keyword5     = 0xFFFFFFFF;
          __var BOCOR_BOOT_Keyword6     = 0xFFFFFFFF;
          __var BOCOR_BOOT_Keyword7     = 0xFFFFFFFF;
        </debugvars>

        <sequences>                                                                <!-- added by ARM -->
        
          <sequence name="ResetHardwareAssert">
            <block>
                __var nReset = 0x80;
              
