saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.SAML11_DFP.1.0.82.pdsc
                // De-assert nRESET line to activate the hardware reset
                DAP_SWJ_Pins(0, nReset, 0);
            </block>

            <control if="__connection &amp; (1 &lt;&lt; 16)" info="Connection under reset - Cold Plugin - otherwise DP is not accessible">
              <block>
                Sequence("ColdPlugin");
              </block>
            </control>
          </sequence>

          <sequence name="ResetHardwareDeassertDefault">
            <block>
              __var nReset      = 0x80;
              __var SWCLK_TCK   = 0x01;
              __var canReadPins = 0;

              // Assert nRESET line and check if nRESET is readable
              canReadPins = (DAP_SWJ_Pins(nReset, nReset, 0) != 0xFFFFFFFF);
            </block>
            <!-- Wait max. 1s for nRESET to recover from reset if readable-->
            <control if="canReadPins" while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
            
            <!-- Wait 100ms for recovery if nRESET not readable -->
            <control if="!canReadPins">
              <block>
                DAP_Delay(100000);
              </block>
            </control>
          </sequence>
          
          <sequence name="ResetHardwareDeassert">
            <block>
              __var SWCLK_TCK   = 0x01;
              
              DAP_SWJ_Pins(SWCLK_TCK, SWCLK_TCK, 0);  // Make sure that SWCLK/TCK is HIGH for hot-plugin
              
              Sequence("ResetHardwareDeassertDefault");
            </block>
              
          </sequence>


          <sequence name="BootDelay">
            <block>
              // Typical Boot Timings for SAML11
              // - BOOTOPT=0         : 2.30 ms
              // - BOOTOPT=1, BS=0x40:  207 ms
              // - BOOTOPT=1, BS=0x80:  409 ms
              // - BOOTOPT=2, BS=0x40:  209 ms
              // - BOOTOPT=2, BS=0x80:  411 ms
              DAP_Delay(420000);                                               // Time for bootloader : Longest period + a few extra ms
                                                                               // Possible Enhancement: Read out Boot options to optimize
            </block>
          </sequence>
          
          <!-- To be callable in uVision (current limitation) -->
          <sequence name="DebugPortSetup">
            <block>
              __var isSWJ    = ((__protocol &amp; 0x00010000) != 0);
              __var protType = __protocol &amp; 0x0000FFFF;
            </block>
            <!-- JTAG Protocol -->
            <control if="protType == 1">
            
              <control if="isSWJ">
              
                <block atomic="1">
                  // Ensure current debug interface is in reset state
                  DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);
                  
                  // Execute SWJ-DP Switch Sequence SWD to JTAG (0xE73C)
                  // Change if SWJ-DP uses deprecated switch code (0xAEAE)
                  DAP_SWJ_Sequence(16, 0xE73C);
                  
                  // Ensure JTAG interface is reset
                  DAP_SWJ_Sequence(6, 0x3F);
                </block>
                
              </control>
            
              <block atomic="1">
                // JTAG "Soft" Reset
                DAP_JTAG_Sequence(6, 1, 0x3F);
                DAP_JTAG_Sequence(1, 0, 0x01);
              </block>
            </control>
            
            <!-- SWD Protocol -->
            <control if="protType == 2">
            
              <control if="isSWJ">
                
                <block atomic="1">
                  // Ensure current debug interface is in reset state
                  DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);
                  
                  // Execute SWJ-DP Switch Sequence JTAG to SWD (0xE79E)
                  // Change if SWJ-DP uses deprecated switch code (0xEDB6)
                  DAP_SWJ_Sequence(16, 0xE79E);
                  
                  // Enter SWD Line Reset State
                  DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);  // &gt; 50 cycles SWDIO/TMS High
                  DAP_SWJ_Sequence(3,  0x00);                // At least 2 idle cycles (SWDIO/TMS Low)
                </block>
              
              </control>
            
              <control if="!isSWJ">
              
                <block atomic="1">
                  // Enter SWD Line Reset State
                  DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);  // &gt; 50 cycles SWDIO/TMS High
                  DAP_SWJ_Sequence(3,  0x00);                // At least 2 idle cycles (SWDIO/TMS Low)
                </block>
                
              </control>
              
              <block>
                // Read DPIDR to enable SWD interface (SW-DPv1 and SW-DPv2)
                ReadDP(0x0);
              </block>
            </control>
            
          </sequence>
          
          <!-- To be callable in uVision (current limitation) -->
          <sequence name="DebugPortStart">
            
            <block>
              __var SW_DP_ABORT  = 0x0;
              __var DP_CTRL_STAT = 0x4;
              __var DP_SELECT    = 0x8;
              __var powered_down = 0;
              
              // Switch to DP Register Bank 0
              WriteDP(DP_SELECT, 0x00000000);
            
              // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
              powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
            </block>
            
            <control if="powered_down">
            
              <block>
                // Request Debug/System Power-Up
                WriteDP(DP_CTRL_STAT, 0x50000000);
              </block>
              
              <!-- Wait for Power-Up Request to be acknowledged -->
              <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000"/>
              
              <!-- JTAG Specific Part of sequence -->
              <control if="(__protocol &amp; 0xFFFF) == 1">
              
                <block>
                  // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                  // Additionally clear STICKYORUN, STICKYCMP, and STICKYERR bits by writing '1'
                  WriteDP(DP_CTRL_STAT, 0x50000F32);
                </block>
                
              </control>
              
              <!-- SWD Specific Part of sequence -->
              <control if="(__protocol &amp; 0xFFFF) == 2">
              
                <block>
                  // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                  WriteDP(DP_CTRL_STAT, 0x50000F00);
                  
                  // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
                  WriteDP(SW_DP_ABORT, 0x0000001E);
                </block>
              </control>
              
            </control>
            
          </sequence>
          

