saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.SAML11_DFP.1.0.82.pdsc
                // Read BOD12 setup from target (must not be changed, calibrated in factory)
                value  = (Read32(0x00804000) &amp; 0x01FF0000);
                value |= UROW_Config0 &amp; 0xFE00FFFF;
                
                // Set UROW contents for programming
                BufferSet(0, 0x00, 0x01, 4, value);
                BufferSet(0, 0x04, 0x01, 4, UROW_Config1);
                BufferSet(0, 0x08, 0x01, 4, UROW_Config2);
                BufferSet(0, 0x0C, 0x01, 4, UROW_Config3);
                BufferSet(0, 0x10, 0x01, 4, UROW_NONSECA);
                BufferSet(0, 0x14, 0x01, 4, UROW_NONSECB);
                BufferSet(0, 0x18, 0x01, 4, UROW_NONSECC);
                
                // Generate UROW Checksum
                Message (0, "Generate UROW checksum...");
                BufferStreamOut(0, 0x08, 0x14, "$P/UROW_contents.bin", 0, 0);
                RunApplication("$S/utilities/GenerateCRC.exe", "\"$P/UROW_contents.bin\" -o \"$P/UROW_crc32.bin\"", "$P", 10000000);
                BufferStreamIn(0, 0x1C, 0x4, "$P/UROW_crc32.bin", 0, 0);
                
                // Erase UROW
                Sequence("EraseUROW");
                
                // Program UROW
                Message (0, "Program UROW...");
                Sequence("PrepareFlashOperation");
                Sequence("ClearFlashPageBuffer");
                BufferWrite(0, 0, 0x00804000, 0x20, 32|1);
                Sequence("ExecPageWrite");
              </block>
            </control>
          </sequence>

          <!-- BOCOR Programming based on dbgconf setup -->
          <sequence name="ProgramBOCOR">
            <block>
              __var PageOffset = 0x00000000;
              __var BOCOR_Addr = 0x0080C000;
              __var BS_BootOpt  = 0;
            </block>
            
            <control if="BOCOR_Program">
              <block>
                // Prepare BOCOR Content Buffer
                BufferSet(0, 0x00, 0x100, 1, 0xFF);
                
                // Set BOCOR contents for programming - Part 1
                BufferSet(0, 0x00, 0x01, 4, BOCOR_Config0);
                BufferSet(0, 0x04, 0x01, 4, BOCOR_Config1);
                
                // Generate BOCOR Checksum
                Message (0, "Generate BOCOR checksum...");
                BufferStreamOut(0, 0, 0x08, "$P/BOCOR_contents_crc32.bin", 0, 0);
                RunApplication("$S/utilities/GenerateCRC.exe", "$P/BOCOR_contents_crc32.bin -o $P/BOCOR_crc32.bin", "$P", 10000000);
                BufferStreamIn(0, 0x08, 0x04, "$P/BOCOR_crc32.bin", 0, 0);
                
                // Set BOCOR contents for programming - Part 2
                BufferSet(0, 0x0C, 0x01, 4, BOCOR_ROMVersion);
                
                BufferSet(0, 0x10, 0x01, 4, BOCOR_CE0_Keyword0);
                BufferSet(0, 0x14, 0x01, 4, BOCOR_CE0_Keyword1);
                BufferSet(0, 0x18, 0x01, 4, BOCOR_CE0_Keyword2);
                BufferSet(0, 0x1C, 0x01, 4, BOCOR_CE0_Keyword3);
                
                BufferSet(0, 0x20, 0x01, 4, BOCOR_CE1_Keyword0);
                BufferSet(0, 0x24, 0x01, 4, BOCOR_CE1_Keyword1);
                BufferSet(0, 0x28, 0x01, 4, BOCOR_CE1_Keyword2);
                BufferSet(0, 0x2C, 0x01, 4, BOCOR_CE1_Keyword3);

                BufferSet(0, 0x30, 0x01, 4, BOCOR_CE2_Keyword0);
                BufferSet(0, 0x34, 0x01, 4, BOCOR_CE2_Keyword1);
                BufferSet(0, 0x38, 0x01, 4, BOCOR_CE2_Keyword2);
                BufferSet(0, 0x3C, 0x01, 4, BOCOR_CE2_Keyword3);
                
                BufferSet(0, 0x40, 0x01, 4, BOCOR_CRC_Keyword0);
                BufferSet(0, 0x44, 0x01, 4, BOCOR_CRC_Keyword1);
                BufferSet(0, 0x48, 0x01, 4, BOCOR_CRC_Keyword2);
                BufferSet(0, 0x4C, 0x01, 4, BOCOR_CRC_Keyword3);
                
                BufferSet(0, 0x50, 0x01, 4, BOCOR_BOOT_Keyword0);
                BufferSet(0, 0x54, 0x01, 4, BOCOR_BOOT_Keyword1);
                BufferSet(0, 0x58, 0x01, 4, BOCOR_BOOT_Keyword2);
                BufferSet(0, 0x5C, 0x01, 4, BOCOR_BOOT_Keyword3);

                BufferSet(0, 0x60, 0x01, 4, BOCOR_BOOT_Keyword4);
                BufferSet(0, 0x64, 0x01, 4, BOCOR_BOOT_Keyword5);
                BufferSet(0, 0x68, 0x01, 4, BOCOR_BOOT_Keyword6);
                BufferSet(0, 0x6C, 0x01, 4, BOCOR_BOOT_Keyword7);

                // Determine BOOTOPT setting for hashsum
                BS_BootOpt = (BOCOR_Config0 &amp; 0x03000000) &gt;&gt; 24;

                Message (0, "Generate BOCOR hashsum...");
              </block>
                
              <control if="BS_BootOpt &lt; 2">
                <block>
                  // Write hashsum input
                  BufferStreamOut(0, 0, 0xE0, "$P/BOCOR_contents.bin", 0x00, 0);  // Write BOCOR contents
                </block>
              </control>

              <control if="BS_BootOpt &gt;= 2">
                <block>
                  // Write hashsum input (including 2*BOOTKEY)
                  BufferStreamOut(0, 0x50, 0x20, "$P/BOCOR_contents.bin", 0x00, 0);  // Write  BOOTKEY: First Time
                  BufferStreamOut(0, 0x50, 0x20, "$P/BOCOR_contents.bin", 0x10, 0);  // Append BOOTKEY: Second Time
                  BufferStreamOut(0, 0x00, 0xE0, "$P/BOCOR_contents.bin", 0x10, 0);  // Append BOCOR contents
                </block>
              </control>

              <block>
                // Generate hashsum
                RunApplication("$S/utilities/GenerateSHA.exe", "$P/BOCOR_contents.bin -o $P/BOCOR_sha256.bin", "$P", 10000000);
                BufferStreamIn(0, 0xE0, 0x20, "$P/BOCOR_sha256.bin", 0, 0);
                
                // Erase BOCOR
                Sequence("EraseBOCOR");
                
                // Prepare BOCOR programming
                Message (0, "Program BOCOR...");
                Sequence("PrepareFlashOperation");
              </block>
              
              <control while="(__Result == 0) &amp;&amp; (PageOffset &lt; 0x100)">
                <block>
                  // Program BOCOR pages
                  Sequence("ClearFlashPageBuffer");
                  BufferWrite(0, PageOffset, BOCOR_Addr + PageOffset, 0x20, 32|1);
                  Sequence("ExecPageWrite");
                  PageOffset += 0x20;
                </block>
              </control>
            </control>
          </sequence>
            
          <sequence name="ProgramBootImageHash">
            <block>
              __var BS_Address  = 0x00000000;
              __var BS_HashAddr = 0x00000000;
              __var BS_Length   = 0;
              __var BNSC_Length = 0;
              __var BS_Setup    = 0;
              __var BS_BootOpt  = 0;
              __var SectorSize  = 0x100;
              __var SectorAddr  = 0x00000000;
              __var PageAddr    = 0x00000000;
              
