saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.SAML11_DFP.1.0.82.pdsc
   <boards>
    <board vendor="Microchip" name="SAML11-XPRO">
      <description>Microchip SAM L11 Xplained Pro Evaluation Kit</description>
      <book category="overview" name="http://www.microchip.com/DevelopmentTools/ProductDetails/dm320205" public="true" title="SAML11 Xplained Pro Eval Kit Web"/>
      <book category="setup" name="http://ww1.microchip.com/downloads/en/AppNotes/Getting-Started-with-SAM%20L10L11-Xplained-Pro-DS00002722A.pdf" public="true" title="Getting Started with SAML10/L11 Xplained"/>
      <image public="true" large="http://www.microchip.com/_ImagedCopy/SAML11%20Xpro%20Front%20Title.jpg" small="http://www.microchip.com/_ImagedCopy/SAML11%20Xpro%20Front%20Title.jpg"/>
      <mountedDevice    deviceIndex="0" Dvendor="Microchip:3" Dname="ATSAML11E16A"/>
      <compatibleDevice deviceIndex="0" Dvendor="Microchip:3" Dname="ATSAML11SAML11*"/>
      <feature type="ODbg"      n="1"              name="Embedded Debugger USB"/>
      <feature type="XTAL"      n="32768"/>
      <feature type="PWR"       n="5"              name="USB Powered (from the Debugger)"/>
      <feature type="PWR"       n="5"              name="External Power"/>
      <feature type="DIO"       n="3"              name="Xplained Pro Extension headers"/>
      <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
      <feature type="LED"       n="1"              name="Yellow User LED"/>
      <feature type="CustomFF"  n="60" m="100"/>
      <debugInterface adapter="Embedded Debugger" connector="Micro-USB"/>
    </board>
  </boards>
   
   <examples>
    <!-- SAML11-XPRO Board -->
    <example name="TrustZone for SAML11 No RTOS" doc="Abstract.txt" folder="mdk/examples/TrustZone_noRTOS">
      <description>Bare metal secure/non-secure example without RTOS</description>
      <board name="SAML11-XPRO" vendor="Microchip"/>
      <project>
        <environment name="uv" load="NoRTOS.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
  </examples>

</package>
